УТ_для_edt/src/DataProcessors/CRM_РаботаСМессенджеромViber/CRM_РаботаСМессенджеромViber.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>CRM_РаботаСМессенджеромViber</name>
  <attributes>
    <name>АдресПубликации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросПолученияСообщений</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросОтправкиСообщений</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

УТ_для_edt/src/DataProcessors/CRM_РаботаСМессенджеромViber/Forms/ФормаНастройки/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьЗначенияСвойств(Объект, Параметры);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	Если ПроверитьЗаполнение() Тогда
		ПараметрыДоступа = Новый Структура;
		ПараметрыДоступа.Вставить("АдресПубликации", Объект.АдресПубликации);
		ПараметрыДоступа.Вставить("ЗапросПолученияСообщений", Объект.ЗапросПолученияСообщений);
		ПараметрыДоступа.Вставить("ЗапросОтправкиСообщений", Объект.ЗапросОтправкиСообщений);
		ПараметрыДоступа.Вставить("Порт", Объект.Порт);

		Закрыть(ПараметрыДоступа);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСправка(Команда)

	ПерейтиПоНавигационнойСсылке(CRM_ОбщегоНазначенияСервер.ПолучитьСсылкуНаРазделСправки("Viber"));

КонецПроцедуры

#КонецОбласти
